app/views/customers/index.html.erb

SELECT `addresses`.* FROM `addresses` WHERE `addresses`.`customer_id` = 1
---
        <td><%= customer.mobile_no rescue ''%></td>
        <td><% customer.addresses.each do|address| %>