app/views/orders/_form.html.erb

            <hr class="colorgraph">
                 <% current_customer.shipping_addresses.each do |address| %>
---
SELECT `shipping_addresses`.* FROM `shipping_addresses` WHERE `shipping_addresses`.`customer_id` = 1