app/views/orders/_form.html.erb

      <script type="text/javascript">
            $(document).ready(function(){

                      $(".showproduct").hide();

                    $("#customeremail").on('keyup' , function(event){

                       $("#customeremail").autocomplete({
                            source: "/orders/autocomplete_email"
                       });
                    });
                    $("#getaddresses").click(function(){
                      email = document.getElementById("customeremail").value;
                        $.ajax({
                            type: "get",
                            url: " /orders/show_addresses" ,
                            data: 'email='+email ,
                            success: function(data){
                            }
                        });
                    });

---
SELECT `products`.* FROM `products`