app/views/orders/_form.html.erb

SELECT `customers`.* FROM `customers`
---
        <div class="col-sm-10">
            <%= f.collection_select(:customer_id ,  Customer.all , :id ,   :fname,  :prompt => 'Select Customer') %>