app/views/orders/index.html.erb

      <tr>
        <td><%= order.order_no %></td>
---
SELECT `orders`.* FROM `orders`


        <td><% order.products.each do |product| %>
---
SELECT `products`.* FROM `products` INNER JOIN `item_lines` ON `products`.`id` = `item_lines`.`product_id` WHERE `item_lines`.`order_id` = 1


            <td><% order.customer.addresses.each do|address| %>
---
SELECT  `customers`.* FROM `customers` WHERE `customers`.`id` = 2 LIMIT 1
SELECT `addresses`.* FROM `addresses` WHERE `addresses`.`customer_id` = 1