app/views/companies/_form.html.erb

SELECT `shipper_details`.* FROM `shipper_details`
---
  <div class="col-sm-10">
     <%= f.collection_select(:shipper_detail_id,  ShipperDetail.all, :id, :fname, :prompt => 'Select Shipper') %>