app/controllers/companies_controller.rb

  def index
    @companies = Company.all
---
SELECT `companies`.* FROM `companies`

  def create
    @company = Company.new(company_params)

    respond_to do |format|
      if @company.save
---
INSERT INTO `companies` (`company_name`, `created_at`, `updated_at`) VALUES ('Micromax pvt ltd', '2016-02-10 05:41:43', '2016-02-10 05:41:43')

    def set_company
      @company = Company.find(params[:id])
---
SELECT  `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1