app/controllers/customers_controller.rb

SELECT `customers`.* FROM `customers`
---
  def index
    @customers = Customer.all

SELECT `customers`.* FROM `customers`
---
  def new
    @customer = Customer.new
    2.times{@customer.addresses.build}
      @customer.orders.build

INSERT INTO `customers` (`email`, `fname`, `lname`, `mobile_no`, `birth_date`, `created_at`, `updated_at`) VALUES ('abc@gmail.com', 'dfdf', 'dfd', 3444, '2016-08-02', '2016-02-10 08:51:39', '2016-02-10 08:51:39')
SELECT  `orders`.* FROM `orders`  ORDER BY `orders`.`id` DESC LIMIT 1
---
  def create
    raise params.inspect
    @customer = Customer.new(customer_params)
    #raise @customer.inspect
    respond_to do |format|
      if @customer.save

            save_item_lines(Order.last.id,params.require(:products))

DELETE FROM `customers` WHERE `customers`.`id` = 1
---
  def destroy
    @customer.destroy

SELECT  `customers`.* FROM `customers` WHERE `customers`.`id` = 1 LIMIT 1
---
    def set_customer
      @customer = Customer.find(params[:id])