app/controllers/orders_controller.rb

  def new
    @order = Order.new
    @all_products =Product.all
---
SELECT `products`.* FROM `products`