app/controllers/orders_controller.rb

SELECT `products`.* FROM `products`
---
  def edit
     @all_products =Product.all

INSERT INTO `orders` (`customer_id`, `order_no`, `tracking_no`, `delivery_date`, `order_value`, `amount`, `delivery_type`, `created_at`, `updated_at`) VALUES (2, 344, 444, '2016-02-17', '34', '32323', 'Is Express Delivery', '2016-02-10 07:11:40', '2016-02-10 07:11:40')
SELECT  `customers`.* FROM `customers` WHERE `customers`.`id` = 1  ORDER BY `customers`.`id` ASC LIMIT 1
INSERT INTO `item_lines` (`order_id`, `product_id`, `created_at`, `updated_at`) VALUES (1, 1, '2016-02-10 07:34:07', '2016-02-10 07:34:07')
---
  def create

    raise params.inspect
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save
        if params[:new_customer]=="true"
            Address.where( id: @order.address_id ).update_all( customer_id: @order.customer_id )
        end
          product_hash = params[:product_ids].split(',')
          product_hash.each do |product|

              if !product.to_s.empty?
                 @item_line = ItemLine.new(:order_id => @order.id , :product_id => product.to_i )
                 @item_line.save

DELETE FROM `orders` WHERE `orders`.`id` = 1
---
  def destroy
    @order.destroy

SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 2 LIMIT 1
---
    def set_order
      #raise params.inspect
      @order = Order.find(params[:id])