app/controllers/products_controller.rb

SELECT `products`.* FROM `products`
---
  def index
    cookies[:cart]=[1,2,2]
    @products = Product.all

SELECT `products`.* FROM `products` WHERE ( product_name LIKE '%a%')
---
  def searchproducts
    #raise params.inspect
      @products = Product.search(params[:search])

SELECT  `products`.* FROM `products` WHERE `category_id`.`category_id` = 2 LIMIT 1
---
  def show
      #raise @product.inspect
      @products = Product.where(:category_id => @product.category_id )

INSERT INTO `products` (`category_id`, `company_id`, `product_name`, `description`, `price`, `quantity`, `sku`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `created_at`, `updated_at`) VALUES (3, 2, 'Micromax Tv', 'Micromax Tv\", \"description\"=>\" Ultra HD (4K), 3840 x 2160, Smart TV,3 x HDMI, 3 x USB,Built-in Wi-Fi', 35990.0, 7, 'Micro101', 'micromax-42c0050uhd-400x400-imae5gc2kezryw3n.jpeg', 'image/jpeg', 49503, '2016-02-08 09:59:56', '2016-02-08 09:59:57', '2016-02-08 09:59:57')
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

SELECT `products`.* FROM `products` WHERE `products`.`id` IN (NULL, NULL)
---
    def set_product
      @product = Product.find(params[:id])