app/controllers/shipper_details_controller.rb

  def index
    @shipper_details = ShipperDetail.all
---
SELECT `shipper_details`.* FROM `shipper_details`

  def create
    @shipper_detail = ShipperDetail.new(shipper_detail_params)

    respond_to do |format|
      if @shipper_detail.save
---
INSERT INTO `shipper_details` (`fname`, `lname`, `email`, `mobile_no`, `created_at`, `updated_at`) VALUES ('Sarvesh', 'Patil', 'patil.sarvesh61@gmail.com', 976477558, '2016-02-08 08:04:03', '2016-02-08 08:04:03')

    def set_shipper_detail
      @shipper_detail = ShipperDetail.find(params[:id])
---
SELECT  `shipper_details`.* FROM `shipper_details` WHERE `shipper_details`.`id` = 1 LIMIT 1