app/views/products/_form.html.erb

SELECT `categories`.* FROM `categories`
---

     <%= f.collection_select(:category_id ,  Category.all , :id ,   :category_name,  :prompt => 'Select Category') %>

SELECT `companies`.* FROM `companies`
---
  <div class="col-sm-10">
     <%= f.collection_select(:company_id,  Company.all, :id ,  :company_name, :prompt => 'Select Company') %>